# объявление функции
def number_to_words(num):
    a1=['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    a11e='надцать'
    a11=[i+a11e for i in a1[0:1]] + [i[:-1]+'е'+a11e for i in a1[1:2]]+\
        [i+a11e for i in a1[2:3]] + [i[:-1] + a11e for i in a1[3:]]
    a22e=a11e[2:]
    a10=['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    if num<10:
        return a1[num-1]
    elif num%10==0:
        return a10[num//10-1]
    elif 10<num<20:
        return a11[num-1-10]
    elif num>20:
        return a10[num//10-1]+' '+ a1[num%10-1]



# считываем данные
n = 30

# вызываем функцию
print(number_to_words(n))